# Groupby

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
xls = pd.ExcelFile("Sales_table.xlsx")
dframe = xls.parse("Sales")
dframe

    Sno       Date Salesperson  Total_amount
0     0 2000-01-03       Allen         12000
1     1 2000-01-04       Allen         15000
2     2 2000-01-05       Allen         25000
3     3 2000-01-03      Mathew         35000
4     4 2000-01-04      Mathew         65000
5     5 2000-01-05      Mathew         75000
6     6 2000-01-03      Clarke         65780
7     7 2000-01-04      Clarke         54670
8     8 2000-01-05      Clarke         77900
9     9 2000-01-03         Don         89000
10   10 2000-01-04         Don         70000
11   11 2000-01-05         Don         65000

In [9]:
group1 = dframe.groupby("Date") # the group is shown as an object which can be manipulated using loops
group1

In [10]:
for group in group1:
    for item in group:
        print(item)

2000-01-03 00:00:00
   Sno       Date Salesperson  Total_amount
0    0 2000-01-03       Allen         12000
3    3 2000-01-03      Mathew         35000
6    6 2000-01-03      Clarke         65780
9    9 2000-01-03         Don         89000
2000-01-04 00:00:00
    Sno       Date Salesperson  Total_amount
1     1 2000-01-04       Allen         15000
4     4 2000-01-04      Mathew         65000
7     7 2000-01-04      Clarke         54670
10   10 2000-01-04         Don         70000
2000-01-05 00:00:00
    Sno       Date Salesperson  Total_amount
2     2 2000-01-05       Allen         25000
5     5 2000-01-05      Mathew         75000
8     8 2000-01-05      Clarke         77900
11   11 2000-01-05         Don         65000

In [14]:
for group in dframe.groupby("Salesperson"): # An alternative method for displaying the data in the group
    print(group)

('Allen',    Sno       Date Salesperson  Total_amount
0    0 2000-01-03       Allen         12000
1    1 2000-01-04       Allen         15000
2    2 2000-01-05       Allen         25000)
('Clarke',    Sno       Date Salesperson  Total_amount
6    6 2000-01-03      Clarke         65780
7    7 2000-01-04      Clarke         54670
8    8 2000-01-05      Clarke         77900)
('Don',     Sno       Date Salesperson  Total_amount
9     9 2000-01-03         Don         89000
10   10 2000-01-04         Don         70000
11   11 2000-01-05         Don         65000)
('Mathew',    Sno       Date Salesperson  Total_amount
3    3 2000-01-03      Mathew         35000
4    4 2000-01-04      Mathew         65000
5    5 2000-01-05      Mathew         75000)